tap "nikitabobko/tap"
tap "olets/tap"

# Core shell/dev tools
brew "git"
brew "git-lfs"
brew "gh"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "bat"
brew "eza"
brew "atuin"
brew "direnv"
brew "mise"
brew "uv"
brew "rustup"
brew "git-delta"
brew "just"
brew "dust"
brew "duf"
brew "watch"
brew "wget"
brew "websocat"
brew "grpcurl"
brew "protobuf"
brew "pre-commit"
brew "starship"
brew "neovim"
brew "tree-sitter"

# Zsh plugins, managed by Brew instead of zplug
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "olets/tap/zsh-abbr"

# Main apps
cask "1password"
cask "1password-cli"
cask "ghostty"
cask "zed"
cask "orbstack"
cask "notion"
cask "raycast"
cask "aerospace"
cask "thaw"
cask "betterdisplay"
cask "openlogi"
cask "linearmouse"

# Fonts
cask "font-monaspice-nerd-font"
cask "font-maple-mono-nf"

# Optional later
# cask "cleanshot"
# cask "betterdisplay"
# cask "stats"
# cask "zotero"
